---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeWarning
source: html/db00a48a-7638-71ff-6533-9f8420f53ab6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeWarning Property

Cannot create a DirectShape or DirectShapeType.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateDirectShapeOrTypeWarning { get; }
```